_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 512, 300)          0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 50)                65200     
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 51        
=================================================================
Total params: 65,251
Trainable params: 65,251
Non-trainable params: 0
_________________________________________________________________
